{
  "popovers": [
    {
      "title": "Front End Development",
      "content": "My bread and butter; I use the latest technologies to architect and write clean, durable code to build optimized responsive experiences and interactive interfaces across platforms and browsers.",
      "tools": [
        "Sass",
        "Vue.js",
        "HTML5"
      ],
      "position": {
        "top": "60%",
        "left": "48%"
      }
    },
    {
      "title": "UX Design",
      "content": "As part of my design process, I create wireframes and rapid prototypes to understand user behavior, conceptualize/validate user interactions and iterate on designs.",
      "tools": [
        "Pen & Paper",
        "Balsamiq",
        "HTML & CSS"
      ],
      "position": {
        "top": "4%",
        "left": "5%"
      }
    },
    {
      "title": "Visual Design",
      "content": "I’m a believer in an agile design process that includes style guides and modular design. I'm a design autodidact and enjoy UI design but prefer to leave pixel-pushing tasks like iconography to specialists.",
      "tools": [
        "Sketch",
        "Zeplin",
        "Sass",
        "Photoshop"
      ],
      "position": {
        "top": "1%",
        "left": "25%"
      }
    },
    {
      "title": "Product Design",
      "content": "I evaluate user needs and business goals to contribute to product strategy and design iterations. I create mockups and iterate on solutions to make sure what I’m building makes sense.",
      "tools": [
        "Asana",
        "Post-it Notes",
        "Whiteboards"
      ],
      "position": {
        "top": "2%",
        "left": "75%"
      }
    },
    {
      "title": "Back End Development",
      "content": "I have experience building RESTful APIs and traditional sites with several backend languages/frameworks, although I prefer to work mainly in the business logic/API layer and leave complex database queries and server setup to specialists.",
      "tools": [
        "Node.js",
        "Ruby on Rails"
      ],
      "position": {
        "top": "4%",
        "left": "90%"
      }
    },
    {
      "title": "Collaboration",
      "content": "I believe communication and solid processes, above all else, are the key to a successful project. I'm a team player and thrive as a group leader, but am also comfortable working autonomously.",
      "tools": [
        "Trello",
        "Slack",
        "Pivotal Tracker",
        "Asana"
      ],
      "position": {
        "top": "40%",
        "left": "53%"
      }
    }
  ]
}