{
  "title": "Projects",
  "subtitle": "Select",
  "list": [
    {
      "id": "explainyourfamily",
      "title": "Explain Your Family",
      "class": "explain-your-family",
      "description": "A simple family tree that's quick to build and easy to share",
      "summary_image": "/images/projects/explain-your-family/explain-your-family-summary.jpg",
      "header_image": "/images/projects/explain-your-family/explain-your-family-tree.jpg",
      "url": "/projects/explain-your-family",
      "badges": [
        "Front End Development",
        "Back End Development",
        "Responsive Web Design",
        "SPA",
        "UX Design",
        "Product Design"
      ],
      "intro_copy": [
        "I built Explain Your Family to scratch my own itch - my girlfriend and I have 24 aunts and uncles between the two of us (and who knows how many cousins...) and as we were each meeting the other's family, we struggled to keep track of who's who.",
        "Explain Your Family sets out to be one thing: an easy place to document your family tree so you can show it to someone else."
      ],
      "ideation": {
        "image": "/images/projects/explain-your-family/explain-your-family-ideation.jpg",
        "copy": [
          "I started by laying out a simple user story (my own). From there, I added features that might help with each step of the user journey, then added details about what those features might entail. I then took those features and plotted them on an impact vs. effort plot and used that to decide what I would include in an MVP version of Explain Your Family.",
          "I realized that the major value prop for my user story would be in creating and plotting people's basic details and mapping their relationships, so I designed how I thought that could be done as simply as possible (conclusion: by sequentially adding people and managing their relationships) and built it."
        ]
      },
      "value": {
        "image": "/images/projects/explain-your-family/explain-your-family-share.jpg",
        "copy": [
          "One key aspect of Explain Your Family is it doesn't require signing up or logging in, as this would be a significant barrier to entry, but you can edit your tree and share it with others (without fear of them editing it)."
        ]
      },
      "tech": {
        "copy": [
          "The site is comprised of a Rails 5 API and an SPA built with Vue.js, Webpack and Bulma/Buefy.",
          "I decided to roll my own vanilla JS tree-rendering algorithm after exploring some existing choices and not finding anything that quite fit the needs of the project."
        ]
      },
      "final": {
        "image": "/images/projects/explain-your-family/explain-your-family-logo.svg",
        "copy": [
          "Check it out at <a href=\"http://explainyourfamily.com\" target=\"_blank\">explainyourfamily.com</a>."
        ]
      }
    },
    {
      "id": "tastingcollective",
      "title": "Tasting Collective",
      "class": "tasting-collective",
      "description": "NYC members-only chef-led restaurant experiences and exclusive perks",
      "summary_image": "/images/projects/tasting-collective/tasting-collective-summary.jpg",
      "header_image": "/images/projects/tasting-collective/tasting-collective-perks.jpg",
      "url": "/projects/tasting-collective",
      "badges": [
        "Front End Development",
        "Responsive Web Design",
        "Ruby on Rails",
        "Remote Work",
        "Contract"
      ],
      "intro_copy": [
        "Tasting Collective members enjoy access to private chef-led dining events at top restaurants, as well as exclusive perks from leading food-related brands.",
        "Working on a small, remote team, I built a responsive interface for Tasting Collective's marketing and membership site. This included collaborating with a backend developer and the CEO."
      ],
      "stack": {
        "image": "/images/projects/tasting-collective/tasting-collective-events.jpg",
        "copy": "The site is built with Ruby on Rails, using Haml templates, Sass and jQuery. I was responsible for manipulating designs in Sketch, full front-end development and project/team management. I utilized Fontello for icons and we deployed to Heroku."
      },
      "single_page": {
        "image": "/images/projects/tasting-collective/tasting-collective-checkout.jpg",
        "title": "Fully Responsive",
        "copy": [
          "The site was designed and built to look great on all viewports and devices.",
          "My role included building interactions that interfaced with a RESTful API, form validation (both client and server-side), custom photo carousels, metadata structuring, page layouts and Google Maps integration. I also contributed extensively to back-end business logic including complex state management, admin data access and email campaigns.",
          "We leveraged several third-party libraries and APIs for payment processing, contact importing, error reporting and site maintenance."
        ]
      },
      "event_detail": {
        "image": "/images/projects/tasting-collective/tasting-collective-event-detail.jpg",
        "copy": "We wanted to keep the focus on the food and all the awesome perks and events, so the site features lots of delicious imagery while still being informative for the user."
      },
      "final": {
        "image": "/images/projects/tasting-collective/tasting-collective-experience-restaurants.jpg",
        "copy": [
          "The site also includes Google Analytics as well as several campaign tracking and analytics libraries.",
          "Check it out at <a href=\"https://tastingcollective.com\" target=\"_blank\">tastingcollective.com</a>."
        ]
      }
    },
    {
      "id": "fillup",
      "title": "FillUp",
      "class": "fillup",
      "description": "An automated drink making machine designed for tailgating",
      "summary_image": "/images/projects/fillup/fillup-summary.jpg",
      "header_image": "/images/projects/fillup/fillup-banner.jpg",
      "url": "/projects/fillup",
      "badges": [
        "Product Design",
        "User Research",
        "Prototyping",
        "Usability Testing"
      ],
      "intro_copy": [
        "FillUp, an automatic drink-mixing machine, was a side project that I worked on over the course of a few football seasons, during which time its iterations became the star of weekend tailgates, camping trips and house parties.",
        "My role in the project included product design, prototyping, facilitating and documenting user feedback, writing the code for the chip, developing the app and building the marketing website."
      ],
      "inspiration": {
        "title": "Inspiration",
        "image": "/images/projects/fillup/fillup-features.jpg",
        "copy": [
          "FillUp was created in collaboration with a friend (a mechanical engineer and obsessive tinkerer) and fellow tailgater. The idea was born when we recognized an opportunity to leverage tailgaters’ desire to one-up other tailgaters with their team spirit and elaborate setups. From catering fancy food options to increasingly exotic lawn games, there's an innate competition in the otherwise light hearted environment, so we decided to get in the game by tackling the not-so-serious drink-dispensing dilemma for tailgaters wanting to outdo the opposing (tailgate) team.",
          "We wanted a device that could transform the mundane, and sometimes messy, task of pouring a drink into an experience that would ignite enthusiastic conversation. All of this in a parking lot--so it had to be flashy, yet compact and functional."
        ]
      },
      "process": {
        "title": "Process",
        "image": "/images/projects/fillup/fillup-iterations.jpg",
        "copy": [
          "In our early research we came across <a href=\"http://somabar.com/\" target=\"_blank\">several</a> <a href=\"https://www.barbotics.com/\" target=\"_blank\">drink-making</a> <a href=\"http://www.smartbarusa.com/\" target=\"_blank\">products</a> geared towards making <a href=\"https://www.theinebriator.com/\" target=\"_blank\">higher-end</a> <a href=\"https://partyrobotics.com/\" target=\"_blank\">cocktails</a>, but none suitable for a tailgate, so we set off to create a version fit for our audience.",
          "We initially defined our audience (early tech-adopting tailgate hosts like ourselves) based on our own by-weekly experience, then documented more design constraints that we identified through a combination of personal experience and talking with other tailgaters. These contraints would develop into FillUp's key features."
        ],
        "table": [
          {
            "requirement": "Low maintenance: quick to set up, quick to break down",
            "constraint": "Needs to be easily assembled, disassembled and cleaned, with a large capacity for liquids to minimize refills"
          },
          {
            "requirement": "Fully operational in a parking lot",
            "constraint": "Can't have reliance on electric hookups, WiFi, etc. and can be easily transported"
          },
          {
            "requirement": "Easy-to-use to suit the casual environment",
            "constraint": "Operation needs to be intuitive (for hosts and users) so instructions don’t kill the mood"
          }
        ],
        "copy2": [
          "We sketched countless ideas for the physical housing and \"plumbing\" that was responsible for pouring a drink, continually tested the interaction between user, app and machine, built rapid prototypes of the housing and spout using household materials, collected continual feedback from friends, and explored and tested hardware (duct tape <i>sometimes</i> works at preventing liquids from succumbing to that whole gravity thing) and software solutions.",
          "Building FillUp was a constantly iterative process; we produced 4 fully functional prototypes that were tested in real time at our tailgates every few weeks."
        ],
        "copy3": [
          "In addition, we constructed several journey maps, including a host's setup on game day, a stranger passing by our product at a neighboring tailgate, and the experience of a “regular” who uses the product weekly. We used these to modify our design to make sure it would be approachable for all of our users."
        ]
      },
      "feedback": {
        "title": "Learning from Feedback",
        "copy": [
          "Throughout our design, build, and testing phases, we constantly learned from our users and adjusted our approach:"
        ],
        "table": [
          {
            "feedback": "There were two main reactions to initially seeing FillUp: <ul class=\"project-list\"><li>Stop and ogle, say \"cool, can it pour me a drink?\" and then move on to socialize</li><li>Say \"wow, how does it work?\" and want a behind-the-scenes look into the machine; this group took pictures and even stuck around to explain how it worked to others.</li></ul>",
            "reaction": "We incorporated transparent plastics into our design to showcase the inner workings of the machine as it poured, which encouraged discussion and feedback amongst users in a way other tailgate props don't (no one asks you to explain how your new grill works)."
          },
          {
            "feedback": "From surveying users we learned the main ways people decide what to drink at a tailgate are:<ul class=\"project-list\"><li>Picking an alcohol then seeking available mixers</li><li>Identifying they want a shot then choosing an alcohol.</li></ul>Rarely did people select a mixer and then an alcohol, or change their mind after deciding they wanted a shot.*",
            "reaction": "We altered the app navigation to start by asking whether the user wanted a shot or a mixed drink. Then came alcohol selection, and in the case of a mixed drink, presenting the options."
          },
          {
            "feedback": "One consistent problem was that people weren't sure when FillUp was finished pouring their drink; users would pull their cup away too early and still-pouring liquid would spill, or they would hesitate and wait unnecessarily before picking up their drink.",
            "reaction": "We programmed LED lights on the machine to display patterns and showed an animation in the app while pouring. When finished, the lights flashed and an alert within the app notified the user that their drink was ready. As an added security measure, we installed a depth sensor that stopped any pouring if the cup was removed prematurely."
          }
        ],
        "note": "* Plenty of people also prefer beer, which FillUp doesn't support because keeping it cold wasn't practical within our design restrictions"
      },
      "logo_branding": {
        "title": "Logo & Branding Process",
        "image": "<svg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 1010 234\" version=\"1.1\"><title>FillUp</title><desc>The first automated drink mixing machine made for tailgaiting</desc><g stroke=\"none\" stroke-width=\"1\" fill=\"none\" fill-rule=\"evenodd\"><path d=\"M703.714005 232.872447L621.622065 232.872447 591 0.650416577 611.679494 1.11459374C611.679494 1.11459374 637.32485 198.485606 644.779071 208.182567 652.233292 217.879527 694.802383 216.006862 702.315964 216.169475 702.505799 216.173583 702.686935 216.188147 702.859688 216.212634 702.870037 216.166402 702.875523 216.142375 702.875523 216.142375 702.875523 216.142375 753.726101 217.879527 761.180321 208.182567 768.634542 198.485606 794.279898 1.11459374 794.279898 1.11459374L814.959392 0.650416577 784.337328 232.872447C784.337328 232.872447 712.966539 232.872447 703.714005 232.872447L703.714005 232.872447Z\" fill=\"#526FA0\"/><g class=\"fillup-liquid\" fill=\"#ED3B40\"><path d=\"M0.8039601 7.63664774C0.803960101 19.2512305 18.3542084 110.776813 18.3542084 110.776813 18.3542084 110.776813 16.0260674 116.394322 65.9831366 116.609489 115.940206 116.824656 115.940203 109.936942 115.940203 109.936942 115.940203 109.936942 134.800305 5.79589524 134.800302 2.86142521 134.800298-0.0730448086 121.859913 0.468011723 106.449231 4.05232974 91.0385487 7.63664775 61.9462445 4.05232971 51.79092 2.36098421 41.6355955 0.669638718 0.803960098-3.97793499 0.8039601 7.63664774Z\" id=\"#ED3B40\"/></g><path d=\"M147.89046 63.4119942L151.289737 1.075 -0.3 1.075 -0.3 233.005115 79.1311905 233.005115 79.1311905 148.265109 130.778629 148.265109 130.778629 94.7638428 79.1311905 94.7638428 79.1311905 63.4119942 147.89046 63.4119942ZM251.787935 233.020969L251.787935 1.075 173.517578 1.075 173.517578 233.020969 251.787935 233.020969ZM419.538762 233.222171L424.545247 172.6384 359.762059 172.6384 360.655362 1.075 280.444966 1.075 280.444966 233.222171 419.538762 233.222171ZM581.263294 233.067844L586.537342 173.231433 522.043362 173.231433 522.830975 1.075 442.622792 1.075 442.622792 233.067844 581.263294 233.067844ZM938.059085 160.589404C958.899181 157.24834 1005.97724 158.101846 1009.06092 89.0117752 1012.14459 19.9217045 975.725 1.075 916.225 1.075L831.235271 1.075 831.235271 233.000171 909.315883 233.000171 909.315883 160.589404 938.059085 160.589404ZM917.563513 112.575L908.35 112.575 908.35 60.075 916.247297 60.075C929.738514 60.075 932.7 68.0496835 932.7 86.6572785 932.7 105.264873 930.067568 112.575 917.563513 112.575Z\" id=\"fillup-text\" fill=\"#526FA0\"/></g></svg>",
        "list": [
          "Our original name, \"The Drink Mixer\", worked well enough amongst friends, but as more people got eyes on it at tailgates, we knew we needed something unique and more memorable. After <a href=\"https://www.nickkolenda.com/brand-names/\" target=\"_blank\">some thought</a>, we came up with FillUp — a personification pun that fit our design principles perfectly, while still conveying its purpose.",
          "Our logo started as a visual analogy of the machine's tanks but quickly lost its meaning as our physical design, and the number of tanks, changed. We needed something that clearly embodied FillUp's purpose and was immediately recognizable; we decided on the plastic cup — a tongue in cheek representation of FillUp and our glass half full (and pouring!) attitude.",
          "For the color scheme of FillUp's physical body and software components, we created a range of bright, strong tones, giving FillUp the attention it deserves even among loud and flashy gameday colors."
        ]
      },
      "design_principles": {
        "title": "Design Principles",
        "copy": "FillUp was guided by a very simple set of design principles:",
        "list": [
          "Be easy and approachable",
          "Be witty to the point of eye-rolling (this is a novelty product, after all)"
        ]
      },
      "implementation": {
        "title": "Implementation",
        "copy": [
          "After several rounds of feedback, we began discussing the potential for bringing a production-quality FillUp to market. But we quickly came to realize that FillUp couldn’t be produced at a reasonable cost for our market without ramping up to a much larger production scale. This would have required outside funding, which we weren't willing to take on.",
          "Even though FillUp wasn't something we intended to produce and market, we still wanted a good way to measure and evaluate our success. We decided that a good metric would be the amount of attention FillUp got from opposing team's fans at the next tailgate without any \"marketing\". Sure enough, we drew in several groups who insisted that regardless of which team won the game, we had certainly won the tailgate."
        ]
      },
      "tech": {
        "title": "Tools & Tech",
        "image": "/images/projects/fillup/fillup-app.jpg",
        "copy": [
          "FillUp is controlled by a custom PhoneGap app that communicates over Bluetooth to an Arduino chip within the machine's housing. This chip controls the machine's LED lights, drink sensor and valves."
        ]
      }
    },
    {
      "id": "morsel",
      "title": "Morsel",
      "class": "morsel",
      "description": "Share the stories, inspirations and techniques that make your food your own",
      "summary_image": "/images/projects/morsel/morsel-summary.jpg",
      "header_image": "/images/projects/morsel/morsel-kevin.jpg",
      "url": "/projects/morsel",
      "badges": [
        "Front End Development",
        "SPA",
        "User Research",
        "Wireframes",
        "UI Design",
        "Responsive Web Design",
        "A/B Testing",
        "User Analytics"
      ],
      "intro_copy": [
        "Morsel was a story-telling platform for those who love food. Built around a community of people passionate about food and drink with a curiosity of what inspires others, Morsel allowed you to see the stories behind the chef's vision, the mixologist's creativity, the sommelier's pairings and the home-cook's creative meals all in one place.",
        "As the first hire and only front-end developer, I was responsible for full UI design and development of <a href=\"https://web.archive.org/web/20150421072804/https://www.eatmorsel.com/\" target=\"_blank\">eatmorsel.com</a>. This included working with the full web stack, interfacing with our API, prototyping and user research."
      ],
      "single_page": {
        "background": "/images/projects/morsel/morsel-troost.jpg",
        "image": "/images/projects/morsel/morsel-mobile.jpg",
        "title": "Morsel on Mobile",
        "copy": [
          "Full functionality (without sacrificing speed) on mobile was a priority for us, so I built the site as a fully responsive single-page app, written in AngularJS on top of a simple Express (Node.js) web server. This allowed functionality updates to be in one codebase, cutting down development time, as well as keeping UI elements consistent across all device sizes.",
          "To grow quickly and consistently across platforms, my teammate built a RESTful API in Ruby on Rails that would interface with both an iOS app and my web app, which further improved perceived loading times on mobile web by only needing to load front-end assets once per user session."
        ]
      },
      "workflow": {
        "image": "/images/projects/morsel/morsel-big-star.jpg",
        "copy": "Some of the things I implemented in the Angular app were file uploads, routing, inline form validations (with client and server side errors) and plenty of responsive, interactive layouts. The front-end development workflow used Grunt with Handlebars templates, Sass/Compass (starting from a custom Twitter Bootstrap configuration) and deployed to Heroku."
      },
      "users": {
        "image": "/images/projects/morsel/morsel-storyboards.jpg",
        "copy": "I had the opportunity to conduct both formative and summative user research (think interviewing a chef in their restaurant) and develop user personas. We used our findings to refine the <i>morsel</i> creation process, among other user flows."
      },
      "final": {
        "copy": [
          "To track user behavior we used Mixpanel and Google Analytics and integrated Rollbar for error reporting."
        ]
      }
    },
    {
      "id": "whereischris",
      "title": "Where Is Chris?",
      "class": "where-is-chris",
      "description": "A public calendar to quickly find out where I am",
      "summary_image": "/images/projects/where-is-chris/where-is-chris-summary.jpg",
      "header_image": "/images/projects/where-is-chris/where-is-chris-calendar.jpg",
      "url": "/projects/where-is-chris",
      "badges": [
        "Responsive Web Design",
        "Side Project",
        "Product Design"
      ],
      "intro_copy": [
        "I like to travel, so I built a quick site so people can keep track of where I am. Now Mom can keep tabs on me, friends know when I'm out of town and clients get a heads up for when I might be working at odd hours."
      ],
      "final": {
        "image": "/images/projects/where-is-chris/where-is-chris-car.svg",
        "copy": [
          "The site pulls in data via the Google Calendar API and displays it with a simple Express server.",
          "Check it out at <a href=\"http://whereis.chriszamierowski.com\" target=\"_blank\">whereis.chriszamierowski.com</a> or the source is available <a href=\"https://github.com/chriszamierowski/where-is-chris\" target=\"_blank\">on Github</a>."
        ]
      }
    },
    {
      "id": "funerals360",
      "title": "Funerals360",
      "class": "funerals360",
      "description": "Online tools and resources for planning a funeral",
      "summary_image": "/images/projects/funerals360/funerals360-summary.jpg",
      "header_image": "/images/projects/funerals360/funerals360-resources.jpg",
      "url": "/projects/funerals360",
      "badges": [
        "Front End Development",
        "Responsive Web Design",
        "Remote Work",
        "Contract"
      ],
      "intro_copy": [
        "Funerals360 was built to help navigate planning a funeral as well as finding and evaluating local funeral homes and the other funeral-related products and services. It's a consumer-friendly, easy-to-navigate and comprehensive website to help guide you along the funeral planning journey including helping find the local businesses you need. Unbiased, transparent information and consumer reviews makes it easier to plan, reduces research time and helps you confidently make funeral decisions.",
        "Working on a small, remote team, I was responsible for the front-end architecture and implementing a responsive interface for Funerals360's site."
      ],
      "search": {
        "video": "/images/projects/funerals360/funerals360-search-from-homepage.mp4",
        "video_poster": "/images/projects/funerals360/funerals360-search-from-homepage-poster.jpg",
        "copy": "A large part of Funerals360 is connecting people to the local businesses they need when planning for a funeral. To facilitate this process I built fully custom, interactive search functionality using Angular and interfacing with a RESTful API. The search page is fully responsive, utilizes several Google Maps API components and includes filtering, advanced search by additional fields, custom saved searches (for logged-in users), loading states, query string search and pagination."
      },
      "tech": {
        "image": "/images/projects/funerals360/funerals360-vendor.jpg",
        "copy": [
          "The front-end styling uses a custom Bootstrap Sass configuration along with a custom Fontello icon set. I used jQuery for most simple page interactions like photo galleries, dynamic form elements, dropdowns and tooltips and AngularJS for several more complicated components.",
          "The site is built on top of Django, including Django CMS, allowing site content to be updated without code deployments. I worked mainly in the View and Template layers, where one challenge was accounting for differing states of the data across vendor pages. We deployed to several Heroku environments."
        ]
      },
      "final": {
        "copy": [
          "Communication was a key aspect of working as part of a remote team across multiple US states and continents. I advised communication strategies and we utilized Slack, Asana, Google Hangouts and Pivotal Tracker to make sure everybody was on the same page with tasks, deliverables and expectations.",
          "My time on the project has ended, but the site is still under active development. Check it out at <a href=\"https://funerals360.com\" target=\"_blank\">funerals360.com</a>."
        ]
      }
    },
    {
      "id": "betterfly",
      "title": "Betterfly",
      "class": "betterfly",
      "description": "Connecting consumers with personal service providers for online lessons",
      "summary_image": "/images/projects/betterfly/betterfly-summary.jpg",
      "header_image": "/images/projects/betterfly/betterfly-homepage.jpg",
      "url": "/projects/betterfly",
      "badges": [
        "Front End Development",
        "UI Design",
        "A/B Testing",
        "User Analytics"
      ],
      "intro_copy": [
        "Betterfly was a community for connecting personal service providers (guitar teachers, life coaches, Spanish tutors, etc) to students looking to learn online.",
        "As the lone front-end developer, I was responsible for full UI design and development, including building a custom online video chat tool."
      ],
      "search": {
        "image": "/images/projects/betterfly/betterfly-search.jpg"
      },
      "video_chat": {
        "image": "/images/projects/betterfly/betterfly-video-chat.jpg",
        "copy": "Betterfly students and teachers were all over the country, so we needed an integrated video tool that was easy to use and fit Betterfly’s existing design. I built Betterfly’s custom video chat using WebRTC and text chat using WebSockets, as well as a diagnostic tool for testing microphone and video connections and internet speed."
      },
      "final": {
        "image": "/images/projects/betterfly/betterfly-guarantee.jpg",
        "copy": [
          "I worked mostly in the View layer of our PHP application, using jQuery, Backbone and Sass on the front-end to build custom interfaces and page layouts.",
          "I also kept tabs on user behavior on the site and implemented A/B tests and user flows using Google Analytics and a suite of other analytics tools.",
          "Betterfly was acquired by <a href=\"http://takelessons.com\" target=\"_blank\">TakeLessons</a> in late 2013."
        ]
      }
    },
    {
      "id": "tompham",
      "disabled": true,
      "title": "Thomas Pham Photography",
      "class": "tompham",
      "description": "Portfolio site of a Chicago photographer",
      "summary_image": "/images/projects/thomas-pham-photography/thomas-pham-photography-summary.jpg",
      "header_image": "/images/projects/thomas-pham-photography/thomas-pham-photography-splash.jpg",
      "badges": [
        "Visual Design",
        "Front End Development",
        "Back End Development"
      ],
      "url": "/projects/thomas-pham-photography",
      "intro_copy": [
        "Tom contacted me to work with him to give his small photography business an online home. He wanted a place to show potential clients some of his existing work and for clients to browse their photos before selecting their final album.",
        "Tom wanted the site to be simple and elegant, with a focus on big photos."
      ],
      "architecture": {
        "video": "/images/projects/thomas-pham-photography/thomas-pham-photography-hover.mp4",
        "video_poster": "/images/projects/thomas-pham-photography/thomas-pham-photography-hover-poster.jpg",
        "copy": [
          "Since Tom's two main areas of focus are weddings and senior portraits, we decided to organize the site using a splash page and two identical sub-sites.",
          "This allowed potential clients to browse info and photos only related to their interest."
        ]
      },
      "contact": {
        "image": "/images/projects/thomas-pham-photography/thomas-pham-photography-contact.jpg",
        "copy": "I used a clean, unobtrusive, black and white design that let Tom's photos shine through on each page."
      },
      "final": {
        "copy": [
          "To minimize Tom's effort needed for client and photo management, I set up a client portal he could manage using Google Docs, which meant no new software to learn or fancy URLs to remember.",
          "The site was built using PHP, CSS and JavaScript. Check it out at <a href=\"http://thomasphamphotography.com\" target=\"_blank\">thomasphamphotography.com</a>"
        ]
      },
      "reception": {
        "image": "/images/projects/thomas-pham-photography/thomas-pham-photography-reception.jpg"
      }
    }
  ]
}