{
  "summaries": {
    "tastingcollective": {
      "name": "Tasting Collective",
      "url": "/projects/tasting-collective",
      "description": "NYC members-only chef-led restaurant experiences and exclusive perks",
      "image": "/images/projects/tasting-collective/tasting-collective-summary.jpg"
    },
    "betterfly": {
      "name": "Betterfly",
      "url": "/projects/betterfly",
      "description": "Connecting consumers with personal service providers for online lessons",
      "image": "/images/projects/betterfly/betterfly-summary.jpg"
    },
    "Tom Pham Photography": {
      "name": "Thomas Pham Photography",
      "url": "/projects/thomas-pham-photography",
      "description": "Portfolio site of a Chicago photographer",
      "image": "/images/projects/thomas-pham-photography/thomas-pham-photography-summary.jpg"
    },
    "morsel": {
      "name": "Morsel",
      "url": "/projects/morsel",
      "description": "Share the stories, inspirations and techniques that make your food your own",
      "image": "/images/projects/morsel/morsel-summary.jpg"
    }
  },
  "detailed": {
    "tompham": {
      "title": "Thomas Pham Photography",
      "class": "tompham",
      "header_image": "/images/projects/thomas-pham-photography/thomas-pham-photography-splash.jpg",
      "badges": [
        "Visual Design",
        "Front End Development",
        "Back End Development"
      ],
      "prev_project": {
        "url": "/projects/betterfly"
      },
      "next_project": {
        "url": "/projects/morsel"
      },
      "intro_copy": [
        "Tom contacted me to work with him to give his small photography business an online home. He wanted a place to show potential clients some of his existing work and for clients to browse their photos before selecting their final album.",
        "Tom wanted the site to be simple and elegant, with a focus on big photos."
      ],
      "architecture": {
        "video": "/images/projects/thomas-pham-photography/thomas-pham-photography-hover.mp4",
        "video_poster": "/images/projects/thomas-pham-photography/thomas-pham-photography-hover-poster.jpg",
        "copy": [
          "Since Tom's two main areas of focus are weddings and senior portraits, we decided to organize the site using a splash page and two identical sub-sites.",
          "This allowed potential clients to browse info and photos only related to their interest."
        ]
      },
      "contact": {
        "image": "/images/projects/thomas-pham-photography/thomas-pham-photography-contact.jpg",
        "copy": "I used a clean, unobtrusive, black and white design that let Tom's photos shine through on each page."
      },
      "final": {
        "copy": [
          "To minimize Tom's effort needed for client and photo management, I set up a client portal he could manage using Google Docs, which meant no new software to learn or fancy URLs to remember.",
          "The site was built using PHP, CSS and JavaScript. Check it out at <a href=\"http://thomasphamphotography.com\" target=\"_blank\">thomasphamphotography.com</a>"
        ]
      },
      "reception": {
        "image": "/images/projects/thomas-pham-photography/thomas-pham-photography-reception.jpg"
      }
    },
    "morsel": {
      "title": "Morsel",
      "class": "morsel",
      "header_image": "/images/projects/morsel/morsel-kevin.jpg",
      "prev_project": {
        "url": "/projects/thomas-pham-photography"
      },
      "next_project": {
        "url": ""
      },
      "badges": [
        "Front End Development",
        "User Research",
        "Wireframes",
        "UI Design",
        "Responsive Web Design",
        "A/B Testing",
        "User Analytics"
      ],
      "intro_copy": [
        "Morsel is a storytelling platform for people who love food. Built around a community of people passionate about food and drink with a curiosity about what inspires others, Morsel allows you to understand the chef's vision, the mixologist's creativity, the sommelier's understanding of what makes a great pairing and the home-cook's creative meals all in one place.",
        "As the first hire and lone front-end developer, I was responsible for full UI design and development of the site. This included working with the full web stack, interfacing with our API, prototyping and user research."
      ],
      "single_page": {
        "background": "/images/projects/morsel/morsel-troost.jpg",
        "image": "/images/projects/morsel/morsel-mobile.jpg",
        "title": "Morsel on Mobile",
        "copy": [
          "Full functionality (without sacrificing speed) on mobile was a priority for us, so I built the site as a fully responsive single-page app, written in AngularJS on top of a simple Express (Node.js) web server. This allowed functionality updates to be in one codebase, cutting down development time, as well as keeping UI elements consistent across all device sizes.",
          "To grow quickly and consistently across platforms, my teammate built a RESTful API in Ruby on Rails that would interface with both an iOS app and my web app, which further improved perceived loading times on mobile web by only needing to load front-end assets once per user session."
        ]
      },
      "workflow": {
        "image": "/images/projects/morsel/morsel-add.jpg",
        "copy": "Some of the things I implemented in the Angular app were file uploads, routing, inline form validations (with client and server side errors) and plenty of responsive, interactive layouts. The front-end development workflow used Grunt with Handlebars templates, Sass/Compass (starting from a custom Twitter Bootstrap configuration) and deployed to Heroku."
      },
      "users": {
        "image": "/images/projects/morsel/morsel-storyboards.jpg",
        "copy": "I had the opportunity to conduct both formative and summative user research (think interviewing a chef in their restaurant) and develop user personas. We used our findings to refine the <i>morsel</i> creation process, among other user flows."
      },
      "final": {
        "image": "/images/projects/morsel/morsel-big-star.jpg",
        "copy": [
          "To see what our users were up to on the site we used Mixpanel and Google Analytics and integrated Rollbar for error reporting.",
          "Morsel still lives on, but my involvement in the product has ceased. Check it out at <a href=\"https://eatmorsel.com\" target=\"_blank\">eatmorsel.com</a>"
        ]
      }
    },
    "betterfly": {
      "title": "Betterfly",
      "class": "betterfly",
      "header_image": "/images/projects/betterfly/betterfly-homepage.jpg",
      "prev_project": {
        "url": "/projects/tasting-collective"
      },
      "next_project": {
        "url": "/projects/thomas-pham-photography"
      },
      "badges": [
        "Front End Development",
        "UI Design",
        "A/B Testing",
        "User Analytics"
      ],
      "intro_copy": [
        "Betterfly was a community for connecting personal service providers (guitar teachers, life coaches, Spanish tutors, etc) to students looking to learn online.",
        "As the lone front-end developer, I was responsible for full UI design and development, including building a custom online video chat tool."
      ],
      "search": {
        "image": "/images/projects/betterfly/betterfly-search.jpg"
      },
      "video_chat": {
        "image": "/images/projects/betterfly/betterfly-video-chat.jpg",
        "copy": "Betterfly students and teachers were all over the country, so we needed an integrated video tool that was easy to use and fit Betterfly’s existing design. I built Betterfly’s custom video chat using WebRTC and text chat using WebSockets, as well as a diagnostic tool for testing microphone and video connections and internet speed."
      },
      "final": {
        "image": "/images/projects/betterfly/betterfly-guarantee.jpg",
        "copy": [
          "I worked mostly in the View layer of our PHP application, using jQuery and Sass on the front-end to build custom interfaces and page layouts.",
          "I also kept tabs on user behavior on the site and implemented A/B tests and user flows using Google Analytics and a suite of other analytics tools.",
          "Betterfly was acquired by <a href=\"http://takelessons.com\" target=\"_blank\">TakeLessons</a> in late 2013."
        ]
      }
    },
    "tastingcollective": {
      "title": "Tasting Collective",
      "class": "tasting-collective",
      "header_image": "/images/projects/tasting-collective/tasting-collective-perks.jpg",
      "prev_project": {
        "url": ""
      },
      "next_project": {
        "url": "/projects/betterfly"
      },
      "badges": [
        "Front End Development",
        "Responsive Web Design",
        "Ruby on Rails"
      ],
      "intro_copy": [
        "Tasting Collective members enjoy access to private chef-led dining events at top restaurants, as well as exclusive perks from leading food-related brands.",
        "Working on a small team, I built a responsive interface for Tasting Collective's marketing and membership site. This included collaborating with a backend developer, a designer and the CEO."
      ],
      "stack": {
        "image": "/images/projects/tasting-collective/tasting-collective-events.jpg",
        "copy": "The site is built with Ruby on Rails, using Haml templates, Sass/Compass (starting from a custom Twitter Bootstrap configuration) and jQuery. I was responsible for manipulating designs in Sketch and full front-end development, including working in the V&C layers of Rails. I utilized Fontello for icons and we deployed to Heroku."
      },
      "single_page": {
        "image": "/images/projects/tasting-collective/tasting-collective-checkout.jpg",
        "title": "Fully Responsive",
        "copy": [
          "The site was designed and built to look great on all viewports and devices.",
          "My development included interfacing with a REST API, form validation (both client and server-side), custom photo carousels, navigation and Google Maps integration. We also utilized and modified several JavaScript Bootstrap components like modals and dropdowns.",
          "We also leveraged several third-party libraries and APIs to enhance the user's experience."
        ]
      },
      "event_detail": {
        "image": "/images/projects/tasting-collective/tasting-collective-event-detail.jpg",
        "copy": "We wanted to keep the focus on the food and all the awesome perks and events, so the site features lots of (delicious) imagery while still being informative for the user."
      },
      "final": {
        "image": "/images/projects/tasting-collective/tasting-collective-experience-restaurants.jpg",
        "copy": [
          "The site also includes Google Analytics as well as several campaign tracking and analytics libraries.",
          "Check it out at <a href=\"https://tastingcollective.com\" target=\"_blank\">tastingcollective.com</a>."
        ]
      }
    }
  }
}